# Pandas library

In [8]:
import pandas as pd

## The Pandas library is one of the most preferred high-level libraries for data scientists to do data manipulation and analysis, next to matplotlib for data visualization and NumPy, the fundamental library for scientific computing in Python on which Pandas was built.

## It is written on top of NumPy (this is why it's high-level).
## The two main structures in Pandas are - DataFrame and Series

## Series

### Series is a structure which looks like 1D array (i.g. Python list). It has the associative index for each element of the list

In [12]:
series = pd.Series([2,4,7,1,4.2])
print(series)
type(series)

0    2.0
1    4.0
2    7.0
3    1.0
4    4.2
dtype: float64

pandas.core.series.Series

### Notice that it has a type of stored elements. In the upper example it was float64

In [14]:
series_int = pd.Series([2,4,7,1,4])
print(series_int)
type(series_int)

0    2
1    4
2    7
3    1
4    4
dtype: int64

pandas.core.series.Series

## The Series structure has attributes 'index' and 'values', by applying which you can obtain the relevant information

In [20]:
print('indexes: ',series.index)
print('values: ',series.values)

indexes:  RangeIndex(start=0, stop=5, step=1)
values:  [2.  4.  7.  1.  4.2]

In [21]:
### you can also index the Series as simple lists

In [25]:
series[2]

7.0

### indexes can be clearly defined

In [30]:
series2 = pd.Series([5, 6, 7, 8, 9, 10], index=['a', 'b', 'c', 'd', 'e', 'f'])
series2['f']

10

In [31]:
series2[['a', 'b', 'f']]

a     5
b     6
f    10
dtype: int64

In [32]:
series2[['a', 'b', 'f']] = 0
series2

a    0
b    0
c    7
d    8
e    9
f    0
dtype: int64

In [33]:
### it looks quite similar to dictionaries

In [36]:
series3 = pd.Series({'a': 5, 'b': 6, 'c': 7, 'd': 8})
series3

a    5
b    6
c    7
d    8
dtype: int64

### Series structure's indexes has 'name' attribute

In [37]:
series3.name = 'numbers'
series3.index.name = 'letters'
series3

letters
a    5
b    6
c    7
d    8
Name: numbers, dtype: int64

### which can be renamed on the go

In [41]:
series3.index = ['A', 'B', 'C', 'D']
series3

A    5
B    6
C    7
D    8
Name: numbers, dtype: int64

## DataFrame

### DataFrame are simply tables. Tables have rows and columns. The columns in the DataFrame are Series, which rows are simply the values of the DataFrame's table

In [47]:
df = pd.DataFrame({
'country': ['Kazakhstan', 'Russia', 'Belarus', 'Ukraine'],
'population': [17.04, 143.5, 9.5, 45.5],
'square': [2724902, 17125191, 207600, 603628]
})
df

      country  population    square
0  Kazakhstan       17.04   2724902
1      Russia      143.50  17125191
2     Belarus        9.50    207600
3     Ukraine       45.50    603628

In [48]:
type(df)

pandas.core.frame.DataFrame

### let's check the type of the single column:

In [52]:
df['country']

0    Kazakhstan
1        Russia
2       Belarus
3       Ukraine
Name: country, dtype: object

In [54]:
type(df['country'])

pandas.core.series.Series

### as you can see it is Series in fact

In [56]:
df.columns

Index(['country', 'population', 'square'], dtype='object')

In [57]:
df.index

RangeIndex(start=0, stop=4, step=1)

## Indexing in DataFrame can be done in two ways: 1) while forming the object itself 2) on the go

In [62]:
df = pd.DataFrame({
'country': ['Kazakhstan', 'Russia', 'Belarus', 'Ukraine'],
'population': [17.04, 143.5, 9.5, 45.5],
'square': [2724902, 17125191, 207600, 603628]
}, index=['KZ', 'RU', 'BY', 'UA'])

In [60]:
df

       country  population    square
KZ  Kazakhstan       17.04   2724902
RU      Russia      143.50  17125191
BY     Belarus        9.50    207600
UA     Ukraine       45.50    603628

### The access to rows can be done in two ways: '.loc' and '.iloc'
#### '.loc' - is used to access by row mark
#### '.iloc ' - is used to access via integer index

In [64]:
df.loc['KZ']

country       Kazakhstan
population         17.04
square           2724902
Name: KZ, dtype: object

In [66]:
df.iloc[1]

country         Russia
population       143.5
square        17125191
Name: RU, dtype: object

### it is possible to access via indexes and columns

In [68]:
df.loc[['KZ', 'RU'], 'population']

KZ     17.04
RU    143.50
Name: population, dtype: float64

### slicing is available too

In [71]:
df.loc['KZ':'BY', :]

       country  population    square
KZ  Kazakhstan       17.04   2724902
RU      Russia      143.50  17125191
BY     Belarus        9.50    207600

### it is possible to filter out using boolean logic

In [74]:
df[df.population > 10][['country', 'square']]

       country    square
KZ  Kazakhstan   2724902
RU      Russia  17125191
UA     Ukraine    603628

### Indexes can be reset

In [76]:
df.reset_index()

  index     country  population    square
0    KZ  Kazakhstan       17.04   2724902
1    RU      Russia      143.50  17125191
2    BY     Belarus        9.50    207600
3    UA     Ukraine       45.50    603628

## When operating on DataFrames pandas return new DataFrame objects

### let's add a new column representing density of population (area / population)

In [105]:
df['density'] = df['population'] / df['square'] * 1000000
df

          coun  population    square    density
KZ  Kazakhstan       17.04   2724902   6.253436
RU      Russia      143.50  17125191   8.379469
BY     Belarus        9.50    207600  45.761079
UA     Ukraine       45.50    603628  75.377550

### The columns can be removed by applying 'drop' function

In [106]:
df = df.drop(['density'], axis='columns')

### you can also rename the columns

In [109]:
df = df.rename(columns={'country': 'coun'})

In [110]:
df

          coun  population    square
KZ  Kazakhstan       17.04   2724902
RU      Russia      143.50  17125191
BY     Belarus        9.50    207600
UA     Ukraine       45.50    603628

## Reading and Writing the files

### Pandas supports reading and writing on different types of files : csv, excel, sql, clipboard, html

### To read the csv you should use read_csv() function

In [116]:
df = pd.read_csv('births1880.csv')
df

     Names  Births
0      Bob     968
1  Jessica     155
2     Mary      77
3     John     578
4      Mel     973

### in order to write the csv file to_csv() function is used. You can add the writing parameters (i.g. you can change the delimiter from comma to tab)

In [120]:
df.to_csv('new_births1880.csv', sep = '\t')

## Grouping and aggregation in pandas

### grouping in pandas is done vid groupby() method. Let's check on Titanic dataset

In [126]:
titanic_df = pd.read_csv('titanic.csv')
titanic_df.head()

,PassengerID,Name,PClass,Age,Sex,Survived,SexCode
0,1,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,2,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,3,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,4,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,5,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

### let's count the number of survived/drawn males and females. We should apply count() method

In [127]:
titanic_df.groupby(['Sex', 'Survived'])['PassengerID'].count()

Sex     Survived
female  0           154
        1           308
male    0           709
        1           142
Name: PassengerID, dtype: int64

In [130]:
### now let's analyze by the cabin's class

In [132]:
titanic_df.groupby(['PClass', 'Survived'])['PassengerID'].count()

PClass  Survived
*       0             1
1st     0           129
        1           193
2nd     0           160
        1           119
3rd     0           573
        1           138
Name: PassengerID, dtype: int64

### Pivot tables in Pandas

### you can use the pivot table when you need to compute among several columns

In [135]:
pvt = titanic_df.pivot_table(index=['Sex'], columns=['PClass'], values='Name', aggfunc='count')

In [137]:
pvt

PClass    *    1st    2nd    3rd
Sex
female  NaN  143.0  107.0  212.0
male    1.0  179.0  172.0  499.0

In [138]:
### let's filter out only females

In [136]:
print(pvt.loc['female', ['1st', '2nd', '3rd']])

PClass
1st    143.0
2nd    107.0
3rd    212.0
Name: female, dtype: float64

## Time stamps in Pandas

### Time stamps is a very useful tool to analyze time series

In [141]:
df = pd.read_csv('apple.csv', index_col='Date', parse_dates=True)

In [145]:
df = df.sort_index()
# head() function prints out only the top 5 elements of the DataFrame
df.head()

,Open,High,Low,Close,Volume,Adj Close
Date,,,,,,
2012-02-23,515.079987,517.830009,509.499992,516.389977,142006900,66.903253
2012-02-24,519.669998,522.899979,518.640015,522.409981,103768000,67.683203
2012-02-27,521.309982,528.500000,516.280014,525.760017,136895500,68.117232
2012-02-28,527.960014,535.410011,525.850006,535.410011,150096800,69.367481
2012-02-29,541.560005,547.610023,535.700005,542.440025,238002800,70.278286

In [144]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 1258 entries, 2012-02-23 to 2017-02-22
Data columns (total 6 columns):
Open         1258 non-null float64
High         1258 non-null float64
Low          1258 non-null float64
Close        1258 non-null float64
Volume       1258 non-null int64
Adj Close    1258 non-null float64
dtypes: float64(5), int64(1)
memory usage: 68.8 KB
None

### let's check out the mean prices of Apple by 'Close' in February 2012

In [147]:
df.loc['2012-Feb', 'Close'].mean()

528.4820021999999

### or from Feb 2012 till Feb 2015

In [151]:
df.loc['2012-Feb':'2015-Feb', 'Close'].mean()

430.43968317018414

### what if we need to get the mean price by weeks?

In [155]:
df.resample('W')['Close'].mean()

Date
2012-02-26    519.399979
2012-03-04    538.652008
2012-03-11    536.254004
2012-03-18    576.161993
2012-03-25    600.990001
2012-04-01    609.698003
2012-04-08    626.484993
2012-04-15    623.773999
2012-04-22    591.718002
2012-04-29    590.536005
2012-05-06    579.831995
2012-05-13    568.814001
2012-05-20    543.593996
2012-05-27    563.283995
2012-06-03    572.539994
2012-06-10    570.124002
2012-06-17    573.029991
2012-06-24    583.739993
2012-07-01    574.070004
2012-07-08    601.937489
2012-07-15    606.080008
2012-07-22    607.746011
2012-07-29    587.951999
2012-08-05    607.217999
2012-08-12    621.150003
2012-08-19    635.394003
2012-08-26    663.185999
2012-09-02    670.611995
2012-09-09    675.477503
2012-09-16    673.476007
                 ...
2016-08-07    105.934003
2016-08-14    108.258000
2016-08-21    109.304001
2016-08-28    107.980000
2016-09-04    106.676001
2016-09-11    106.177498
2016-09-18    111.129999
2016-09-25    113.606001
2016-10-02    113.029999
2016-10-09    113.303999
2016-10-16    116.860000
2016-10-23    117.160001
2016-10-30    115.938000
2016-11-06    111.057999
2016-11-13    109.714000
2016-11-20    108.563999
2016-11-27    111.637503
2016-12-04    110.587999
2016-12-11    111.231999
2016-12-18    115.094002
2016-12-25    116.691998
2017-01-01    116.642502
2017-01-08    116.672501
2017-01-15    119.228000
2017-01-22    119.942499
2017-01-29    121.164000
2017-02-05    125.867999
2017-02-12    131.679996
2017-02-19    134.978000
2017-02-26    136.904999
Freq: W-SUN, Name: Close, Length: 262, dtype: float64

### resample() is a very powerful function for timeseries analyses

### The very first parameter of resample function is the mode. Here 'W' stands for weekly frequence. You can find more about it following this link: http://pandas.pydata.org/pandas-docs/stable/timeseries.html#offset-aliases

#### this tutorial is taken from the brilliant article which can be found here: https://khashtamov.com/ru/pandas-introduction/